### Connect to the local database where Pagila is loaded

In [1]:
import sql
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = '*****'
DB_PASSWORD = '*****'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)

postgresql://*****:*****@127.0.0.1:5432/pagila

In [ ]:
%sql $conn_string

## Slicing

Slicing is the reduction of the dimensionality of a cube by 1 e.g. 3 dimensions to 2, fixing one of the dimensions to a single value. In the example above, we have a 3-dimensional cube on day, rating, and country.

In [14]:
%%time
%%sql

SELECT d.day AS day,
       m.rating AS rating,
       c.city AS city,
       sum(f.sales_amount) AS revenue     
FROM factSales as f
JOIN dimdate d ON (f.date_key = d.date_key)
JOIN dimmovie m ON (f.movie_key = m.movie_key)
JOIN dimcustomer c on (f.customer_key = c.customer_key)
WHERE rating ='PG-13'
GROUP BY (day, rating, city)
ORDER BY revenue desc
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.
Wall time: 22 ms

[(30, 'PG-13', 'Zanzibar', Decimal('21.97')),
 (28, 'PG-13', 'Dhaka', Decimal('19.97')),
 (29, 'PG-13', 'Shimoga', Decimal('18.97')),
 (30, 'PG-13', 'Osmaniye', Decimal('18.97')),
 (21, 'PG-13', 'Asuncin', Decimal('18.95'))]

## Dicing
Dicing is creating a subcube with the same dimensionality but fewer values for  two or more dimensions. 

Query to create a subcube of the initial cube that includes moves with:
* ratings of PG or PG-13
* in the city of Bellevue or Lancaster
* day equal to 1, 15, or 30

In [17]:
%%time
%%sql

SELECT d.day AS day,
       m.rating AS rating,
       c.city AS city,
       sum(f.sales_amount) AS revenue     
FROM factSales as f
JOIN dimdate d ON (f.date_key = d.date_key)
JOIN dimmovie m ON (f.movie_key = m.movie_key)
JOIN dimcustomer c on (f.customer_key = c.customer_key)
WHERE rating in ('PG-13','PG') 
AND city in ('Bellevue', 'Lancaster') 
AND day in ('1', '15', '30') 
GROUP BY (day, rating, city)
ORDER BY revenue desc
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.
Wall time: 9.96 ms

[(30, 'PG', 'Lancaster', Decimal('12.98')),
 (1, 'PG-13', 'Lancaster', Decimal('5.99')),
 (30, 'PG-13', 'Bellevue', Decimal('3.99')),
 (30, 'PG-13', 'Lancaster', Decimal('2.99')),
 (15, 'PG-13', 'Bellevue', Decimal('1.98'))]

# Roll-up
Stepping up the level of aggregation to a large grouping
e.g.city is summed as country

In [18]:
%%time
%%sql

SELECT d.day AS day,
       m.rating AS rating,
       c.country AS country,
       sum(f.sales_amount) AS revenue     
FROM factSales as f
JOIN dimdate d ON (f.date_key = d.date_key)
JOIN dimmovie m ON (f.movie_key = m.movie_key)
JOIN dimcustomer c on (f.customer_key = c.customer_key)
GROUP BY (day, rating, country)
ORDER BY revenue desc
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.
Wall time: 21.7 ms

[(30, 'G', 'China', Decimal('169.67')),
 (30, 'PG', 'India', Decimal('156.67')),
 (30, 'NC-17', 'India', Decimal('153.64')),
 (30, 'PG-13', 'China', Decimal('146.67')),
 (30, 'R', 'China', Decimal('145.66'))]

# Drill-down
Breaking up one of the dimensions to a lower level.
e.g.city is broken up into districts

In [19]:
%%time
%%sql

SELECT d.day AS day,
       m.rating AS rating,
       c.district AS district,
       sum(f.sales_amount) AS revenue     
FROM factSales as f
JOIN dimdate d ON (f.date_key = d.date_key)
JOIN dimmovie m ON (f.movie_key = m.movie_key)
JOIN dimcustomer c on (f.customer_key = c.customer_key)
GROUP BY (day, rating, district)
ORDER BY revenue desc
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.
Wall time: 32 ms

[(30, 'PG-13', 'Southern Tagalog', Decimal('53.88')),
 (30, 'G', 'Inner Mongolia', Decimal('38.93')),
 (30, 'G', 'Shandong', Decimal('36.93')),
 (30, 'NC-17', 'West Bengali', Decimal('36.92')),
 (17, 'PG-13', 'Shandong', Decimal('34.95'))]

# Grouping Sets
- It happens often that for 3 dimensions, you want to aggregate a fact:
    - by nothing (total)
    - then by the 1st dimension
    - then by the 2nd 
    - then by the 3rd 
    - then by the 1st and 2nd
    - then by the 2nd and 3rd
    - then by the 1st and 3rd
    - then by the 1st and 2nd and 3rd
    
- Since this is very common, and in all cases, we are iterating through all the fact table anyhow, there is a more clever way to do that using the SQL grouping statement "GROUPING SETS"

In [24]:
%%time
%%sql

SELECT d.day AS day,
       m.rating AS rating,
       c.district AS district,
       sum(f.sales_amount) AS revenue     
FROM factSales as f
JOIN dimdate d ON (f.date_key = d.date_key)
JOIN dimmovie m ON (f.movie_key = m.movie_key)
JOIN dimcustomer c on (f.customer_key = c.customer_key)
GROUP by grouping sets((), day, rating, district, (day, rating), (rating, district), (day, rating, district))
ORDER BY revenue desc
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.
Wall time: 83.5 ms

[(None, None, None, Decimal('67416.51')),
 (None, 'PG-13', None, Decimal('15259.16')),
 (None, 'NC-17', None, Decimal('13885.02')),
 (None, 'PG', None, Decimal('13337.91')),
 (None, 'R', None, Decimal('13270.19'))]

# CUBE
Group by CUBE (dim1, dim2, ..) , produces all combinations of different lenghts in one go.
This view could be materialized in a view and queried which would save lots repetitive aggregations

In [25]:
%%time
%%sql

SELECT d.day AS day,
       m.rating AS rating,
       c.district AS district,
       sum(f.sales_amount) AS revenue     
FROM factSales as f
JOIN dimdate d ON (f.date_key = d.date_key)
JOIN dimmovie m ON (f.movie_key = m.movie_key)
JOIN dimcustomer c on (f.customer_key = c.customer_key)
GROUP by cube(day, rating, district)
ORDER BY revenue desc
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.
Wall time: 115 ms

[(None, None, None, Decimal('67416.51')),
 (None, 'PG-13', None, Decimal('15259.16')),
 (None, 'NC-17', None, Decimal('13885.02')),
 (None, 'PG', None, Decimal('13337.91')),
 (None, 'R', None, Decimal('13270.19'))]